Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_glossary_of_immigration_terms_a_checklist.html.txt.tmx
Source language: en
Languages: ga

source: Glossary of immigration terms
ga: Gluais de Théarmaí Inimirce

source: Glossary of Immigration Terms
ga: Gluais de Théarmaí Inimirce

source: │Asylum seeker│A person who is seeking to be recognised as a Convention refugee under the Geneva │
ga: │Iarrthóir │Duine atá ag iarraidh go n-aithneofaí é mar Dhídeanaí Coinbhinsiúin faoi │

source: │ │Written permission from the Minister for Justice and Equality to a non-EEA │
ga: │ │Seo cead scríofa ón Aire Dlí agus Cirt agus Comhionannais do náisiúnach │

source: │ │national to allow you to become established and engage in business in Ireland
ga: │ │neamh-LEE le ligeann duit tú féin a lonnú agus dul i mbun gnó in Éirinn

source: │Business │Business permission usually lasts for 1 year initially
ga: │ │gnách go dtugtar cead gnó ar feadh bliain amháin ar dtús

source: │permission │A visa-required national will still need a visa as well as the business │
ga: │Cead gnó │Náisiúnach nach mór víosa a bheith aige/aici, beidh víosa ag teastáil uaidh nó │

source: │ │If you hold a business permission, you will have residence stamp number 1 endorsed│
ga: │ │Má tá cead gnó agat déanfar an stampa cónaithe uimhir 1 ar do phas a │

source: │ │The type of visa that allows a visa-required national to come to Ireland with a │
ga: │ │An chineál víosa a ligeann do náisiúnach nach mór víosa a bheith aige/aici │

source: │C Visa │view to staying a maximum of 90 days (3 months)
ga: │Víosa C │teacht go hÉirinn agus é ar intinn aige nó aici fanacht ar feadh 90 lá (3 mhí) │

source: │ │holder must leave the State on or before expiry of the visa
ga: │ │nuair a éagann an víosa nó roimhe sin

source: │ │A card issued to all legally resident non-EEA nationals who stay in Ireland for │
ga: │ │Cárta a eisítear do gach náisiúnach neamh-LEE a bhfuil cónaí dlíthiúil orthu in│

source: │ │more than 3 months
ga: │ │Éirinn agus a fhanann in Éirinn ar feadh níos faide ná 3 mhí

source: Possession of this Certificate of Registration verifies that │
ga: │ │Clárúcháin seo ag duine dearbhaíonn sé gur chláraigh siad lena n-oifigeach │

source: │of │The card is a credit-card sized document
ga: │ │ │ │Deimhniú │Doiciméad ar an méid céanna le cárta creidmheasa atá sa chárta

source: │Registration │number of the relevant residence stamp (see below), date of expiry and the GNIB │
ga: │clárúcháin │grianghraf den duine, uimhir an stampa chónaithe ábhartha (féach thíos) dáta │

source: Sometimes called a GNIB card or a residence permit
ga: Uaireanta tugtar cárta BNGSI nó cead │

source: │ │several different versions of the card, depending on the person’s status, which │
ga: │ │ │ │ │Tá go leor leaganacha éagsúla den chárta ann, ag brath ar stádas an duine. Tá │

source: There is a fee for the card of €300 (with exceptions)
ga: Gearrtar táille €300 ar an │ │ │gcárta (le heisceachtaí)

source: │ │A person who is recognised as being a refugee under the criteria set down in the │
ga: │ │Duine atá aitheanta mar dhídeanaí faoi na critéir atá leagtha amach i │

source: │Convention │1951 Geneva Convention relating to the Status of Refugees, as implemented by │
ga: │Dídeanaí │gCoinbhinsiúin na Ginéive 1951 i dtaobh Stádas Dídeanaithe, mar atá curtha i │

source: │refugee │legislation in Ireland
ga: │Coinbhinsiúin │bhfeidhm ag an reachtaíocht in Éirinn

source: │ │A Convention refugee will receive residence stamp no. 4 and will not need an │
ga: │ │Gheobhaidh dídeanaí Coinbhinsiúin stampa cónaithe uimhir 4 agus ní gá dó/dí le │

source: │ │employment permit or business permission to work in Ireland
ga: │ │cead fostaíochta ná cead gnó le hoibriú in Éirinn

source: │Critical │The Critical Skills Employment Permit is for a restricted list of occupations in │
ga: │Cead │Baineann Cead Fostaíochta Scileanna Ríthábhachtacha le liosta srianta gairme sa│

source: │Skills │the annual salary range from €30,000 to €60,000 and for occupations in the annual │
ga: │Fostaíochta │raon tuarastail bliantúil idir €30,000 agus €60,000 agus do ghairmeacha sa raon│

source: │Employment │salary range above €60,000
ga: │Scileanna │tuarastail bliantúil thar €60,000

source: If you hold a Critical Skills Employment Permit you │
ga: Má tá Cead Fostaíochta Scileanna │

source: │Permit │will have residence stamp number 1 endorsed on your passport. │
ga: │Ríthábhachtacha│Ríthábhachtacha agat déanfar stampa cónaithe uimhir 1 a fhormhuiniú ar do phas.│

source: │ │A visa that allows a visa-required national to come to Ireland with a view to │
ga: │ │Víosa a ligeann do náisiúnach nach mór víosa a bheith aige/aici teacht go │

source: │D Visa │staying more than 90 days (3 months)
ga: │Víosa D │hÉirinn agus é ar intinn aige/aici fanacht níos faide ná 90 lá (3 mhí)

source: │ │A citizen of one of the member states of the European Economic Area (EEA)
ga: │ │Saoránach as ceann de na ballstáit sa Limistéar Eorpach Eacnamaíoch (LEE)

source: │ │is made up of the EU member states (see EU national below) together with Iceland, │
ga: │ │an LEE comhdhéanta de Bhallstáit an AE (féach náisiúnach AE thíos) i dteannta │

source: There are similar arrangements for Swiss nationals so │
ga: Baineann socruithe cosúlacha do │

source: │EEA national │the term EEA national is often used to cover EEA and Swiss nationals
ga: │ │náisiúnaigh na hEilvéise agus mar sin is minic go n-úsáidtear an téarma │

source: │ │No residence stamp is placed on the passport of an EEA national on arrival in │
ga: │ │ │ │ │Ní chuirtear aon stampa cónaithe ar phas náisiúnach LEE nuair a thagann sé/sí │

source: │ │In general an EEA national does not need an employment permit or business │
ga: │ │De ghnáth ní gá do náisiúnach LEE le cead fostaíochta ná cead gnó le hoibriú in│

source: │ │A document which non-EEA nationals must have in order to be allowed to work in │
ga: │ │Doiciméad nach mór bheith ag náisiúnaigh neamh-LEE le cead a fháil oibriú in │

source: │permit │There are 9 types of employment permit including General Employment Permit and │
ga: │Cead │ │ │fostaíochta │Tá 9 saghas de cheadanna fostaíochta lena n-áirítear á Cead Fostaíochta │

source: │ │Critical Skills Employment Permit
ga: │ │Ginearálta agus Cead Fostaíochta Scileanna Ríthábhachtacha

source: If you hold an employment permit, you will have│
ga: Má tá cead │

source: │ │residence stamp number 1 endorsed on your passport
ga: │ │fostaíochta agat, déanfar stampa cónaithe uimhir 1 ar do phas a fhormhuiniú

source: │ │A citizen of the European Union
ga: │ │Saoránach den Aontas Eorpach

source: The members of the EU are: Austria, Belgium, │
ga: Is iad baill an AE ná: An Ostair, an Bheilg, an │

source: │ │Bulgaria, Croatia, Cyprus, the Czech Republic, Denmark, Estonia, Finland, France, │
ga: │ │Chróit, an Chipir, Poblacht na Seice, an Danmhairg, an Eastóin, an Fhionlainn, │

source: │ │Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, │
ga: │ │an Fhrainc, an Ghearmáin, an Ghréig, an Ungáir, Éire, an Iodáil, an Laitvia, │

source: │EU national │the Netherlands, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and │
ga: │Náisiúnach AE │Lucsamburg, Málta, an Íoslainn, an Pholainn, an Phortaingéil, an Rómáin, an │

source: │or EU citizen│the United Kingdom
ga: │nó saoránach AE│tSlóvaic, an tSlóivéin, an tSualainn agus an Ríocht Aontaithe

source: │ │No residence stamp is placed on the passport of an EU national on arrival in │
ga: │ │Ní chuirtearstampa cónaithe ar phas náisiúnach AE nuair a thagann sé/sí go │

source: An EU national does not need an employment permit or business permission │
ga: Is féidir le náisiúnach AE oibriú in Éirinn gan ghá le cead │

source: │ │to work in Ireland
ga: │ │fostaíochta ná cead gnó

source: │National │The Garda National Immigration Bureau (GNIB) is responsible for all │
ga: │Síochána um │sé an deimhniú clárúcháin inimirce nó an cárta BNGSI (féach thíos) do │

source: │ │A type of employment permit issued for occupations in the annual salary range from│
ga: │ │Cineál cead fostaíochta a eisítear do ghairmeacha sa raon tuarastail bliantúil │

source: │General │€30,000 to €60,000 and for a very few employments with annual salaries below │
ga: │ │idir €30,000 agus €60,000 agus do chúpla cineál fostaíochta le tuarastail │

source: Some occupations are ineligible for employment permits and the employer │
ga: Tá roinnt gairmeacha neamh-incháilithe do cheadanna │

source: │Permit │must have shown that the relevant vacancy could not be filled from within the EEA │
ga: │Fostaíochta │oibre agus ní mór don fhostóir léiriú nach bhféadfaí an folúntas ábhartha a │

source: It lasts for 2 years and is renewable
ga: Maireann sé ar feadh 2 bliana agus│

source: If you hold a General │
ga: │ │is féidir é a athnuachan

source: │ │Employment Permit you will have residence stamp number 1 on your passport
ga: Má tá Cead Fostaíochta Ginearálta agat beidh stampa │ │ │cónaithe uimhir 1 ar do phas

source: │GNIB card │Another name for the immigration certificate of registration
ga: │Cárta BNGSI │Ainm eile don deimhniú clárúcháin inimirce

source: │ │Immigration officers are appointed under statute by the Minister for Justice and │
ga: │ │Ceapann an tAire Dlí agus Cirt agus Comhionannais oifigigh inimirce faoi │

source: Their functions include interviewing those arriving in the State to │
ga: Áirítear lena gcuid feidhmeanna agallamh a chur orthu siúd a thagann │

source: │Immigration │establish whether they are foreign nationals, and if so, whether they have the │
ga: │Oifigeach │chuig an Stát le socrú an náisiúnaigh eachtrannacha iad, agus más iad, an │

source: │officer │correct documents and whether they should be given permission to land or be in the│
ga: │inimirce │bhfuil na doiciméid chearta acu agus an ceart cead a thabhairt dóibh tuirlingt │

source: This permission generally takes the form of a stamp on the passport
ga: Is gnách go dtugtar an cead sin i bhfoirm stampa ar an │

source: │ │usually known as a residence stamp or it may be a landing stamp only. │
ga: Tugtar stampa cónaithe air sin de ghnáth nó d'fhéadfadh nach mbeadh ann │

source: │ │A member of the Garda Síochána who is responsible for the registration of non-EEA │
ga: │ │Ball den Gharda Síochána atá freagrach as náisiúnaigh neamh-LEE a fhanann in │

source: │Immigration │nationals who stay in Ireland for more than 3 months
ga: │ │Éirinn ar feadh níos faide ná 3 mhí a chlárú

source: │registration │In the Dublin metropolitan region this function resides with the Burgh Quay │
ga: │Oifigeach │ │ │clárúcháin │I réigiún cathrach Bhaile Átha Cliath is é an Oifig Chlárúcháin Cé an Bhúrcaigh│

source: Outside this area, the local immigration registration officer│
ga: │ │t-oifigeach clárúcháin inimirce áitiúil ná an Ceannfort ag ceanncheathrú dúiche│

source: │ │is the Superintendent at the local Garda district headquarters
ga: │ │áitiúil an Gharda Síochána. │

source: │ │The type of Certificate of Registration issued to a non-EEA national family member│
ga: │ │An cineál deimhniú clárúcháin a eisítear do bhall teaghlaigh saoránaigh AE a │

source: │Permanent │of an EU citizen who has lived in the State for 5 years
ga: │ │bhfuil cónaí air/uirthi sa Stát le 5 bliana nach náisiúnach LEE é/í

source: │residence │fact that the family member’s permission to remain is residence stamp no
ga: │Cárta │Tabharfaidh an cárta sin taifead gurb é an cead atá ag an mball teaghlaigh │

source: Even if the holder is a visa-required national, they will not need a re-entry │
ga: │ │bheith aige/aici, é an sealbhóir ní bheidh gá acu le víosa athiontrála nuair a │

source: │ │visa when returning to Ireland after a stay abroad
ga: │ │fhilleann siad ar Éirinn tar éis seala thar lear

source: Application form EU 3 is used │
ga: │ │EU 3 le cur isteach ar an gcineál sin cárta BNGSI

source: │ │to apply for this type of GNIB card
ga: Ní ghearrtar aon táille

source: │Permanent │A letter issued to an EU citizen who has lived in Ireland for 5 years or more
ga: │ │Litir a eisítear doshaoránach AE a bhfuil cónaí air/uirthi in Éirinn le 5 │

source: │residence │Application form EU 2 is used apply for this certificate. There is no fee
ga: │ │Úsáidtear an fhoirm iarratais EU 2 le cur isteach ar an deimhniú sin

source: │ │A non-EEA national dependant (or partner) of an EU citizen who is not a qualifying│
ga: │ │Cleithiúnach, céile nó páirtnéir sibhialta náisiúnaigh AE nach náisiúnach LEE é│

source: │ │family member (see below)
ga: │ │/í nach ball teaghlaigh cáilithe é/í (féach thíos)

source: They have completed an application form EU1A and have │
ga: Líon siad foirm iarratais │

source: │Permitted │been approved as a permitted family member by the Irish Naturalisation and │
ga: │ │EU 1A agus tugadh cead dóibh mar bhall teaghlaigh ceadaithe ag Seirbhís │

source: │family member│Immigration Service (INIS) under the European Communities (Free Movement of │
ga: │Ball teaghlaigh│Eadóirseachta agus Inimirce na hÉireann faoi Rialachán na gComhphobal Eorpach │

source: │ │A permitted family member will receive residence stamp no. 4 EU-FAM and will not │
ga: │ │Gheobhaidh ball teaghlaigh ceadaithe stampa cónaithe uimhir 4 EU-FAM agus ní gá│

source: │ │need an employment permit or business permission to work in Ireland
ga: │ │dó/dí le cead fostaíochta ná cead gnó le hoibriú in Éirinn

source: │ │A person who has been invited to Ireland by the government, usually in response to│
ga: │ │Duine ar thug an Rialtas cuireadh dó/di go hÉirinn, mar fhreagra ar ghéarchéim │

source: │Programme │a humanitarian crisis and at the request of the United Nations High Commissioner │
ga: │ │dhaonnúil de ghnáth agus ar iarratas Ard-Choimisinéir na Náisiún Aontaithe do │

source: In general, they have the same rights as Convention refugees
ga: Go ginearálta, bíonn na cearta céanna acu agus a bhíonn ag │

source: 4 on their passport and will not│
ga: │ │Beidh stampa cónaithe uimhir 4 ar phas dídeanaí cláir agus ní gá dó/dí le cead │

source: │ │The non-EEA national spouse, civil partner or dependent relative of an EU citizen │
ga: │ │An chéile, páirtnéir sibhialta nó gaol cleithiúnach le saoránach AE nach │

source: │ │who has exercised the right to move to and live in Ireland under the European │
ga: │ │náisiúnach LEE é/í a chleachtaigh an ceart bogadh go hÉirinn agus cónaí inti │

source: │ │Communities (Free Movement of Persons) Regulations 2015
ga: │ │faoi Rialacháin na gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015

source: │Qualifying │A person who has been approved by INIS as a qualifying family member and has │
ga: │cáilithe │Gheobhaidh duine a cheadaigh Seirbhís Eadóirseachta agus Inimirce na hÉireann │

source: │family member│completed an application form EU1 will receive residence stamp no
ga: │ │mar bhall teaghlaigh cáilithe agus a líon foirm iarratais EU 1 stampa cónaithe │

source: 4 EU-FAM and │ │ │will not need an employment permit or business permission to work in Ireland
ga: │ │uimhir 4 EU-FAM agus ní gá dó/dí le cead fostaíochta ná cead gnó le hoibriú in │

source: │ │Certificate of Registration will be 4 EU-FAM (which is the residence card of a │
ga: Is é an deimhniú clárúcháin a bheidh ann ná 4 EU-FAM (arb é cárta │

source: │ │family member of a EU citizen. │
ga: │ │cónaithe baill teaghlaigh saoránaigh AE) │

source: │ │A type of Certificate of Registration that is issued to a non-EEA citizen who is a│
ga: │ │An cineál deimhniú clárúcháin a eisítear do shaoránach neamh-LEE ar ball │

source: │Residence │qualifying family member or permitted family member of an EU citizen under the │
ga: │ │teaghlaigh cáilithe nó ball teaghlaigh ceadaithe de chuid saoránaigh AE é/í │

source: │card │European Communities (Free Movement of Persons) Regulations 2015
ga: │Cárta cónaithe │faoi Rialacháin na gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015

source: │ │Form EU 1 or EU 1A is used to apply for this card
ga: │ │ │ │ │Úsáidtear Foirm EU 1 nó EU 1A le cur isteach ar an gcárta seo

source: │ │The type of Certificate of Registration issued to non-EEA national dependants of │
ga: │ │An cineál deimhniú clárúcháin a eisítear do chleithiúnaigh ar náisiúnaigh │

source: │ │citizens of Iceland, Norway, Liechtenstein and Switzerland under the European │
ga: │ │neamh-LEE iad le saoránaigh as an Íoslainn, an Iorua, Lichtinstéin agus an │

source: │ │Communities (Aliens) Regulations 1977 and the European Communities (Right of │
ga: │ │Eilvéis faoi Rialacháin na gComhphobal Eorpach (Eachtrannaigh) 1977 agus │

source: │ │Residence for Non-Economically Active Persons) Regulations 1997
ga: │ │Gníomhach ó thaobh an Gheilleagair de) 1997

source: │Residence │Formerly issued to non-EEA dependants of citizens of all the EEA and Switzerland, │
ga: │Doiciméad │ │ │cónaithe │Eisíodh é roimhe seo do chleithiúnaigh neamh-LEE le saoránaigh an LEE go léir │

source: │document │it is no longer issued to non-EEA dependants of EU citizens, who qualify for │
ga: │ │agus na hEilvéise. Ní eisítear é a thuilleadh do chleithiúnaigh neamh-LEE le │

source: │ │will not need an employment permit or business permission to work in Ireland
ga: │ │gá dó/dí le cead fostaíochta ná cead gnó le hoibriú in Éirinn

source: │ │form is now used to apply for this as well
ga: │ │EU 1 le cur isteach air sin freisin

source: There is no fee
ga: Ní ghearrtar aon táille

source: │Residence │An endorsement placed on the passport of a non-EEA national permitting them to │
ga: │ │Cuirtear formhuiniú ar phas náisiúnach neamh-LEE a thugann cead dóibh fanacht │

source: It specifies the duration for which the person is permitted to │
ga: Sonraíonn sé a fhaide agus a bhfuil cead ag an duine fanacht agus na│

source: │permission to│remain and the conditions under which they may remain (for example, whether they │
ga: │Stampa cónaithe│coinníollacha ar féidir leo fanacht fúthu (mar shampla, an bhfuil cead acu a │

source: │remain │are allowed to work or not)
ga: │nó cead fanacht│bheith ag obair nó nach bhfuil)

source: This stamp must be kept up to date at all times
ga: Ní mór an stampa a choimeád suas le dáta i │

source: │ │The different types of stamp are explained below
ga: │ │ │ │ │Tá míniú ar na cineálacha éagsúla stampa thíos

source: │ │Issued to a non-EEA national, for example, who is permitted to remain in Ireland │
ga: │ │Eisítear é do náisiúnach neamh-LEE a bhfuil cead fanacht in Éirinn acu chun │

source: │Stamp number │for a specific, temporary and limited purpose on condition that they do not │
ga: │Stampa uimhir 0│chríoch sonrach, sealadach agus teoranta, ar an gcoinníoll nach bhfaigheann │

source: │0 │receive State benefits and have private medical insurance. Examples include a │
ga: │ │said sochair Stáit agus go bhfuil árachas sláinte príobháideach acu, mar │

source: │ │retired person of independent means or a visiting academic
ga: │ │shampla, duine scortha le acmhainní neamhspleácha nó acadóir ar cuairt

source: │Stamp number │Issued to a non-EEA national who has received an employment permit, a business │
ga: │ │Eisítear é do náisiúnach neamh-LEE a fuair cead fostaíochta, cead gnó nó údarú │

source: │1 │permission or a working holiday authorisation
ga: │Stampa uimhir 1│saoire oibre

source: Since 1 March 2014 there are new │
ga: Ó 2014 tá socruithe speisialta le haghaidh dochtúirí neamh-LEE ag│

source: │Stamp number │Issued to a non-EEA national trainee accountant (pdf)
ga: │Stampa uimhir │Eisítear é do cuntasóir faoi oiliúint neamh-LEE (pdf)

source: │Stamp number │Issued to students who are permitted to remain under the Third Level Graduate │
ga: │Stampa uimhir │Eisítear é do mhac léinn a bhfuil cead fanacht aige/aici faoin Scéim Chéimithe │

source: │Stamp number │Issued to a non-EEA national student who is permitted to work for up to 20 hours a│
ga: │ │oibriú suas go 20 uair in aghaidh na seachtaine i rith an téarma agus suas go │

source: │2 │week during term and up to 40 hours a week during holidays
ga: │Stampa uimhir 2│40 uair in aghaidh na seachtaine le linn na laethanta saoire

source: (The student must be │
ga: (Ní mór go mbeadh│

source: │ │attending a full-time recognised course of at least a year)
ga: │ │an mac léinn ag freastal ar chúrsa lán-aimseartha a mhaireann bliain ar a │

source: │Stamp number │Issued to a non-EEA national student who is not permitted to work
ga: │Stampa uimhir │Eisítear é do mhac léinn ar náisiúnach neamh-LEE é/í nach bhfuil cead aige/aici│ │2A │oibriú

source: │Stamp number │Issued to a non-EEA national who is not permitted to work, such as a visitor, a │
ga: │ │Eisítear é do náisiúnach neamh-LEE nach bhfuil cead aige/aici oibriú, mar │

source: │3 │minister of religion or the spouse, civil partner or dependant of an employment │
ga: │Stampa uimhir 3│shampla, cuairteoir; ministir reiligiúin; céile agus cleithiúnaí shealbhóirí │

source: │ │Issued to the following categories of people, all of whom do not need an │
ga: │ │Eisítear é do na catagóirí seo a leanas de dhaoine agus is féidir leo go léir │

source: │ │employment permit to work in Ireland. │
ga: │ │oibriú gan ghá le cead fostaíochta: │

source: │ │ • *Spouses and civil partners of Irish nationals │
ga: │ │ • *Céilí nó páirtnéirí sibhialta náisiúnaigh Éireannacha │

source: │ │ • *Family members of EEA nationals │
ga: │ │ • *Cleithiúnaithe le náisiúnaigh LEE │

source: │ │ • *People who have permission to remain on the basis of parentage of an Irish │
ga: │ │ • *Daoine a bhfuil cead acu fanacht toisc gur tuismitheoir linbh Éireannaigh │

source: │Stamp number │ child │
ga: │Stampa uimhir 4│ iad │

source: │4 │ • *People granted international protection (refugeeor subsidiary protection │
ga: │ │ • Daoine ar deonaíodh cosaint idirnáisiúnta (stádas dídeanaí nó cosanta │

source: │ │ • *Former asylum-seekers granted leave to remain │
ga: │ │ • *Iar-iarrthóirí tearmainn ar tugadh cead dóibh fanacht │

source: │ │ • Non-EEA nationals on intra-company transfer │
ga: │ │ • Náisiúnaigh neamh-LEE ar aistriú idirchomhlachta │

source: │ │ • Non-EEA nationals who have working visas or work authorisations │
ga: │ │ • Náisiúnaigh neamh-LEE a bhfuil víosaí oibre nó údaraithe oibre acu │

source: │ │In addition, people in the category marked * do not need a business permission
ga: │ │*Is féidir le daoine sa chatagóir seo marcáilte * oibriú gan ghá le cead gnó

source: │ │Issued to non-EEA national family members of EU citizens who have exercised their │
ga: │ │Eisítear é do bhall teaghlaigh ar náisiúnaigh neamh-LEE iad le saoránaigh AE a │

source: │ │right to move to and live in Ireland under the European Communities (Free Movement│
ga: │ │chleachtaigh a gceart bogadh go hÉirinn agus cónaí ann faoi Rialacháin na │

source: │Stamp number │of Persons) Regulations 2015
ga: │Stampa uimhir 4│gComhphobal Eorpach (Saorghluaiseacht Daoine) 2015

source: │4 (EU FAM) │People holding this stamp are permitted to work without needing an employment │
ga: │(EU FAM) │ │ │ │Is féidir le daoine a bhfuil an stampa seo acu oibriú gan ghá le cead │

source: │ │permit or business permission, and they can apply for a residence card under the │
ga: │ │fostaíochta nó cead gnó, agus féadann siad cur isteach ar chárta cónaithe faoi │

source: │ │Issued to non-EEA nationals who have lived in Ireland for at least 8 years and who│
ga: │ │Eisítear é do náisiúnaigh neamh-LEE a bhfuil cónaí orthu in Éirinn ar feadh 8 │

source: │Stamp number │have been permitted by the Minister for Justice and Equality to remain in Ireland │
ga: │ │mbliana ar a laghad agus ar thug an tAire Dlí agus Cirt agus Comhionannais cead│

source: │5 │without condition as to time (WCATT)
ga: │Cárta uimhir 5 │dóibh fanacht in Éirinn gan choinníoll ama (WCATT)
